package com.edu.bean;

import java.util.LinkedHashMap;
import java.util.Map;

public class CityMap {
	/**
	 * 全国（省，直辖市，自治区，特别行政区）映射集合
	 */
	public static Map<String, String[]> model = new LinkedHashMap();

	static {
		model.put("请选择", new String[] { "请选择" });
		model.put("京津冀",
				new String[] { "请选择", "北京中关村", "北京国贸", "北京通州", "北京回龙观", "北京艾特", "翡翠昌平", "天津南开", "天津新安", "石家庄民族路" });
		model.put("上海区", new String[] { "请选择", "上海虹口完美", "上海虹口卓新", "上海徐汇", "上海株洲路", "上海浦东" });
		model.put("西北区", new String[] { "请选择", "西安国贸", "西安华融", "西安太白", "西安钟楼", "太原小店", "太原长风街",
				"郑州金水", "郑州国泰" });
		
		model.put("华中区", new String[] { "请选择", "长沙书院", "长沙雨花", "长沙中扬", "武汉洪山", "武汉江汉", "常婵红谷滩", "南昌二分" });
		model.put("华北区", new String[] { "请选择", "济南历下", "济南新泺", "青岛南区", "沈阳沈河", "沈阳和平", "大连中山" });
		model.put("华南区",
				new String[] { "请选择", "深圳华强北", "深圳罗湖", "深圳福田", "广州黄埔", "广州元岗", "广州长兴", "柳州广场路", "南宁西乡塘", "福州台江" });
		model.put("华东区", new String[] { "请选择", "合肥新都会", "合肥长江路", "南京玄武", "南京雨花台", "苏州姑苏", "常州钟楼", "无锡滨湖", "杭州下城",
				"杭州二分", "宁波鄞州" });
		model.put("西南区", new String[] { "请选择", "重庆完美", "重庆天陈", "重庆渝中", "成都桐梓林", "成都天府新谷", "成都牛王庙", "贵阳南明" });

	}

}
